## 인덱스 조작

In [1]:
import numpy as np 
import pandas as pd

### set_index

In [3]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [4]:
df2 = df1.set_index('C1')       # inplace=False 가 디폴트
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [5]:
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [6]:
df1.set_index('C1', inplace=True)
df1

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

### reset_index()

In [8]:
df1.reset_index()

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [9]:
df1

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [10]:
df1.reset_index(inplace=True)
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

### 연습문제

In [12]:
# 1) 
np.random.seed(2021)
df_score1 = pd.DataFrame(np.random.randint(60, 101, size=(5, 3)),
                         columns=['국어','영어','수학'])
df_score1

   국어  영어  수학
0  81  60  90
1  82  87  89
2  81  89  84
3  72  66  98
4  66  93  97

In [13]:
df_score1.index = ['Kim', 'Lee', 'Park', 'Choi', 'Chung']
df_score1.index.name = '이름'
df_score1

       국어  영어  수학
이름
Kim    81  60  90
Lee    82  87  89
Park   81  89  84
Choi   72  66  98
Chung  66  93  97

In [14]:
df_score2 = df_score1.reset_index()
df_score2

      이름  국어  영어  수학
0    Kim  81  60  90
1    Lee  82  87  89
2   Park  81  89  84
3   Choi  72  66  98
4  Chung  66  93  97

In [15]:
df_score2.set_index('이름', inplace=True)
df_score2

       국어  영어  수학
이름
Kim    81  60  90
Lee    82  87  89
Park   81  89  84
Choi   72  66  98
Chung  66  93  97